const data = [
  { date: '1月20日',	累计确诊: 291,	'现有确诊*': 260,	现有重症: null,	累计死亡: 6,		累计治愈:25 },
  { date: '1月21日',	累计确诊: 440,	'现有确诊*': 403,	现有重症: 102,	累计死亡: 9,		累计治愈:28 },
  { date: '1月22日',	累计确诊: 571,	'现有确诊*': 526,	现有重症: 95,	累计死亡: 17,	累计治愈:28,		现有疑似:393 },
  { date: '1月23日',	累计确诊: 830,	'现有确诊*': 771,	现有重症: 177,	累计死亡: 25,	累计治愈:34,		现有疑似:1072 },
  { date: '1月24日',	累计确诊: 1287,	'现有确诊*': 1208,	现有重症: 237,	累计死亡: 41,	累计治愈:38,		现有疑似:1965 },
  { date: '1月25日',	累计确诊: 1975,	'现有确诊*': 1870,	现有重症: 324,	累计死亡: 56,	累计治愈:49,		现有疑似:2684 },
  { date: '1月26日',	累计确诊: 2744,	'现有确诊*': 2613,	现有重症: 461,	累计死亡: 80,	累计治愈:51,		现有疑似:5794 },
  { date: '1月27日',	累计确诊: 4515,	'现有确诊*': 4349,	现有重症: 976,	累计死亡: 106,	累计治愈:60,		现有疑似:6973 },
  { date: '1月28日',	累计确诊: 5974,	'现有确诊*': 5739,	现有重症: 1239,	累计死亡: 132,	累计治愈:103,	现有疑似:9239 },
  { date: '1月29日',	累计确诊: 7711,	'现有确诊*': 7417,	现有重症: 1370,	累计死亡: 170,	累计治愈:124,	现有疑似:12167 },
  { date: '1月30日',	累计确诊: 9692,	'现有确诊*': 9308,	现有重症: 1527,	累计死亡: 213,	累计治愈:171,	现有疑似:15238 },
  { date: '1月31日',	累计确诊: 11791,	'现有确诊*': 11289,	现有重症: 1795,	累计死亡: 259,	累计治愈:243,	现有疑似:17988 },
  { date: '2月1日',		累计确诊: 14380,	'现有确诊*': 13748,	现有重症: 2110,	累计死亡: 304,	累计治愈:328,	现有疑似:19544 },
  { date: '2月2日', 	累计确诊: 17205,	'现有确诊*': 16369,	现有重症: 2296,	累计死亡: 361,	累计治愈:475,	现有疑似:21558 },
  { date: '2月3日', 	累计确诊: 20438,	'现有确诊*': 19381,	现有重症: 2788,	累计死亡: 425,	累计治愈:632,	现有疑似:23214 },
  { date: '2月4日', 	累计确诊: 24324,	'现有确诊*': 22942,	现有重症: 3219,	累计死亡: 490,	累计治愈:892,	现有疑似:23260 },
  { date: '2月5日', 	累计确诊: 28018,	'现有确诊*': 26302,	现有重症: 3859,	累计死亡: 563,	累计治愈:1153,	现有疑似:24702 },
  { date: '2月6日', 	累计确诊: 31161,	'现有确诊*': 28985,	现有重症: 4821,	累计死亡: 636,	累计治愈:1540,	现有疑似:26359 },
  { date: '2月7日', 	累计确诊: 34546,	'现有确诊*': 31774,	现有重症: 6101,	累计死亡: 722,	累计治愈:2050,	现有疑似:27657 },
  { date: '2月8日', 	累计确诊: 37198,	'现有确诊*': 33738,	现有重症: 6188,	累计死亡: 811,	累计治愈:2649,	现有疑似:28942 },
  { date: '2月9日', 	累计确诊: 40171,	'现有确诊*': 35982,	现有重症: 6484,	累计死亡: 908,	累计治愈:3281,	现有疑似:23589 },
  { date: '2月10日', 	累计确诊: 42638,	'现有确诊*': 37626,	现有重症: 7333,	累计死亡: 1016,	累计治愈:3996,	现有疑似:21675 },
  { date: '2月11日', 	累计确诊: 44653,	'现有确诊*': 38800,	现有重症: 8204,	累计死亡: 1113,	累计治愈:4740,	现有疑似:16067 },
  { date: '2月12日', 	累计确诊: 59804,	'现有确诊*': 39194,	'现有确诊**':52526,	现有重症: 8030,	累计死亡: 1367,	累计治愈:5911,	现有疑似:13435 },
  { date: '2月13日', 	累计确诊: 63851,	'现有确诊**':55748,	现有重症: 10204,	累计死亡: 1380,	累计治愈:6723,	现有疑似:10109 },
  { date: '2月14日', 	累计确诊: 66492,	'现有确诊**':56873,	现有重症: 11053,	累计死亡: 1523,	累计治愈:8096,	现有疑似:8969 },
  { date: '2月15日', 	累计确诊: 68500,	'现有确诊**':57416,	现有重症: 11272,	累计死亡: 1665,	累计治愈:9419,	现有疑似:8228 },
  { date: '2月16日', 	累计确诊: 70548,	'现有确诊**':57934,	现有重症: 10644,	累计死亡: 1770,	累计治愈:10844,	现有疑似:7264 },
  { date: '2月17日', 	累计确诊: 72436,	'现有确诊**':58016,	现有重症: 11741,	累计死亡: 1868,	累计治愈:12552,	现有疑似:6242 },
  { date: '2月18日', 	累计确诊: 74185,	'现有确诊**':57805,	现有重症: 11977,	累计死亡: 2004,	累计治愈:14376,	现有疑似:5248 },
  { date: '2月19日', 	累计确诊: 74576,	'现有确诊**':56303,	现有重症: 11864,	累计死亡: 2118,	累计治愈:16155,	现有疑似:4922 },
  { date: '2月20日', 	累计确诊: 75465,	'现有确诊**':54965,	现有重症: 11633,	累计死亡: 2236,	累计治愈:18264,	现有疑似:5206 },
  { date: '2月21日', 	累计确诊: 76288,	'现有确诊**':53284,	现有重症: 11477,	累计死亡: 2345,	累计治愈:20659,	现有疑似:5365 },
  { date: '2月22日', 	累计确诊: 76936,	'现有确诊**':51606,	现有重症: 10968,	累计死亡: 2442,	累计治愈:22888,	现有疑似:4148 },
  { date: '2月23日', 	累计确诊: 77150,	'现有确诊**':49824,	现有重症: 9915,	累计死亡: 2592,	累计治愈:24734,	现有疑似:3434 },
  { date: '2月24日', 	累计确诊: 77658,	'现有确诊**':47672,	现有重症: 9126,	累计死亡: 2663,	累计治愈:27323,	现有疑似:2824 },
  { date: '2月25日', 	累计确诊: 78064,	'现有确诊**':45604,	现有重症: 8752,	累计死亡: 2715,	累计治愈:29745,	现有疑似:2491 },
  { date: '2月26日', 	累计确诊: 78497,	'现有确诊**':43258,	现有重症: 8346,	累计死亡: 2744,	累计治愈:32495,	现有疑似:2358 },
  { date: '2月27日', 	累计确诊: 78824,	'现有确诊**':39919,	现有重症: 7952,	累计死亡: 2788,	累计治愈:36117,	现有疑似:2308 },
  { date: '2月28日', 	累计确诊: 79251,	'现有确诊**':37414,	现有重症: 7664,	累计死亡: 2835,	累计治愈:39002,	现有疑似:1418 },
  { date: '2月29日', 	累计确诊: 79824,	'现有确诊**':35329,	现有重症: 7365,	累计死亡: 2870,	累计治愈:41625,	现有疑似:851 },
  { date: '3月1日', 	累计确诊: 80026,	'现有确诊**':32652,	现有重症: 7110,	累计死亡: 2912,	累计治愈:44462,	现有疑似:715 },
  { date: '3月2日', 	累计确诊: 80151,	'现有确诊**':30004,	现有重症: 6806,	累计死亡: 2943,	累计治愈:47204,	现有疑似:587 },
  { date: '3月3日', 	累计确诊: 80270,	'现有确诊**':27433,	现有重症: 6416,	累计死亡: 2981,	累计治愈:49856,	现有疑似:520 },
  { date: '3月4日', 	累计确诊: 80409,	'现有确诊**':25352,	现有重症: 5952,	累计死亡: 3012,	累计治愈:52045,	现有疑似:522 },
  { date: '3月5日', 	累计确诊: 80552,	'现有确诊**':23784,	现有重症: 5737,	累计死亡: 3042,	累计治愈:53726,	现有疑似:482 },
  { date: '3月6日', 	累计确诊: 80651,	'现有确诊**':22177,	现有重症: 5489,	累计死亡: 3070,	累计治愈:55404,	现有疑似:502 },
  { date: '3月7日', 	累计确诊: 80695,	'现有确诊**':20533,	现有重症: 5264,	累计死亡: 3097,	累计治愈:57065,	现有疑似:458 },
  { date: '3月8日', 	累计确诊: 80735,	'现有确诊**':19016,	现有重症: 5111,	累计死亡: 3119,	累计治愈:58600,	现有疑似:421 },
  { date: '3月9日', 	累计确诊: 80754,	'现有确诊**':17721,	现有重症: 4794,	累计死亡: 3136,	累计治愈:59897,	现有疑似:349 },
  { date: '3月10日', 	累计确诊: 80778,	'现有确诊**':16145,	现有重症: 4492,	累计死亡: 3158,	累计治愈:61475,	现有疑似:285 },
  { date: '3月11日', 	累计确诊: 80793,	'现有确诊**':14831,	现有重症: 4257,	累计死亡: 3169,	累计治愈:62793,	现有疑似:253 },
  { date: '3月12日', 	累计确诊: 80813,	'现有确诊**':13526,	现有重症: 4020,	累计死亡: 3176,	累计治愈:64111,	现有疑似:147 },
  { date: '3月13日', 	累计确诊: 80824,	'现有确诊**':12094,	现有重症: 3610,	累计死亡: 3189,	累计治愈:65541,	现有疑似:115 },
  { date: '3月14日', 	累计确诊: 80844,	'现有确诊**':10734,	现有重症: 3226,	累计死亡: 3199,	累计治愈:66911,	现有疑似:113 },
  { date: '3月15日', 	累计确诊: 80860,	'现有确诊**':9898,	现有重症: 3032,	累计死亡: 3213,	累计治愈:67749,	现有疑似:134 },
  { date: '3月16日', 	累计确诊: 80881,	'现有确诊**':8976,	现有重症: 2830,	累计死亡: 3226,	累计治愈:68679,	现有疑似:128 },
  { date: '3月17日', 	累计确诊: 80894,	'现有确诊**':8056,	现有重症: 2622,	累计死亡: 3237,	累计治愈:69601,	现有疑似:119 },
  { date: '3月18日', 	累计确诊: 80928,	'现有确诊**':7263,	现有重症: 2314,	累计死亡: 3245,	累计治愈:70420,	现有疑似:105 },
  { date: '3月19日', 	累计确诊: 80967,	'现有确诊**':6569,	现有重症: 2136,	累计死亡: 3248,	累计治愈:71150,	现有疑似:104 },
  { date: '3月20日', 	累计确诊: 81008,	'现有确诊**':6013,	现有重症: 1963,	累计死亡: 3255,	累计治愈:71740,	现有疑似:106 },
  { date: '3月21日', 	累计确诊: 81054,	'现有确诊**':5549,	现有重症: 1845,	累计死亡: 3261,	累计治愈:72244,	现有疑似:118 },
  { date: '3月22日', 	累计确诊: 81093,	'现有确诊**':5120,	现有重症: 1749,	累计死亡: 3270,	累计治愈:72703,	现有疑似:136 },
  { date: '3月23日', 	累计确诊: 81171,	'现有确诊**':4735,	现有重症: 1573,	累计死亡: 3277,	累计治愈:73159,	现有疑似:132 },
  { date: '3月24日', 	累计确诊: 81218,	'现有确诊**':4287,	现有重症: 1399,	累计死亡: 3281,	累计治愈:73650,	现有疑似:134 },
  { date: '3月25日', 	累计确诊: 81285,	'现有确诊**':3947,	现有重症: 1235,	累计死亡: 3287,	累计治愈:74051,	现有疑似:159 },
  { date: '3月26日', 	累计确诊: 81340,	'现有确诊**':3460,	现有重症: 1034,	累计死亡: 3292,	累计治愈:74588,	现有疑似:189 },
  { date: '3月27日', 	累计确诊: 81394,	'现有确诊**':3128,	现有重症: 921,	累计死亡: 3295,	累计治愈:74971,	现有疑似:184 },
  { date: '3月28日', 	累计确诊: 81439,	'现有确诊**':2691,	现有重症: 742,	累计死亡: 3300,	累计治愈:75448,	现有疑似:174 }
];
const ds = new DataSet();
const dv = ds.createView().source(data);
// fold 方式完成了行列转换，如果不想使用 DataSet 直接手工转换数据即可
dv.transform({
  type: 'fold',
  fields: [ '现有确诊*', '现有确诊**', '现有重症', '累计死亡', '累计治愈', '现有疑似' ], // 展开字段集,去掉了'累计确诊', 
  key: 'type',   // key字段
  value: 'value' // value字段
});
// 实例化 Chart 对象
const chart = new G2.Chart({
  container: 'container',	  // 传入 dom 容器的 id
  forceFit: true,			  // 图表跟随图表容器宽度变化
  height: 500,				  // 指定图表的高度
  padding: [ 20, 38, 110, 70 ] // 上，右，下，左
});
chart.source(dv, {
  date: {
	range: [ 0, 1 ]
  }
});
chart.tooltip({
  crosshairs: {
	type: 'line'
  }
});
chart.scale('date', {
  ticks: ['1月20日', '2月1日', '2月15日', '3月1日', '3月16日'],
});
chart.axis('value', {
  label: {
	formatter: val => {
	  return val + '例';
	}
  }
});
chart
  .line()
  .position('date*value')
  .color('type', ['#f00', '#f00', '#b00', '#333', '#0b0', '#fd0'])	//去掉了'累计确诊'的'#f99', 
  .shape('smooth');
chart
  .point()
  .position('date*value')
  .color('type', ['#f00', '#f00', '#b00', '#333', '#0b0', '#fd0'])	//去掉了'累计确诊'的'#f99', 
  .size(4)
  .shape('circle')
  .style({
	stroke: '#fff',
	lineWidth: 1
  });
chart.render();	// 图表渲染
