const data = [
  { date: '1月20日',累计确诊: 291,	'现有确诊*': 260,	现有重症: null,	累计死亡: 6,		累计治愈:25 },
  { date: '21',		累计确诊: 440,	'现有确诊*': 403,	现有重症: 102,	累计死亡: 9,		累计治愈:28 },
  { date: '22',		累计确诊: 571,	'现有确诊*': 526,	现有重症: 95,	累计死亡: 17,	累计治愈:28,		现有疑似:393 },
  { date: '23',		累计确诊: 830,	'现有确诊*': 771,	现有重症: 177,	累计死亡: 25,	累计治愈:34,		现有疑似:1072 },
  { date: '24',		累计确诊: 1287,	'现有确诊*': 1208,	现有重症: 237,	累计死亡: 41,	累计治愈:38,		现有疑似:1965 },
  { date: '25',		累计确诊: 1975,	'现有确诊*': 1870,	现有重症: 324,	累计死亡: 56,	累计治愈:49,		现有疑似:2684 },
  { date: '26',		累计确诊: 2744,	'现有确诊*': 2613,	现有重症: 461,	累计死亡: 80,	累计治愈:51,		现有疑似:5794 },
  { date: '27',		累计确诊: 4515,	'现有确诊*': 4349,	现有重症: 976,	累计死亡: 106,	累计治愈:60,		现有疑似:6973 },
  { date: '28',		累计确诊: 5974,	'现有确诊*': 5739,	现有重症: 1239,	累计死亡: 132,	累计治愈:103,	现有疑似:9239 },
  { date: '29',		累计确诊: 7711,	'现有确诊*': 7417,	现有重症: 1370,	累计死亡: 170,	累计治愈:124,	现有疑似:12167 },
  { date: '30',		累计确诊: 9692,	'现有确诊*': 9308,	现有重症: 1527,	累计死亡: 213,	累计治愈:171,	现有疑似:15238 },
  { date: '31',		累计确诊: 11791,	'现有确诊*': 11289,	现有重症: 1795,	累计死亡: 259,	累计治愈:243,	现有疑似:17988 },
  { date: '2月1日',	累计确诊: 14380,	'现有确诊*': 13748,	现有重症: 2110,	累计死亡: 304,	累计治愈:328,	现有疑似:19544 },
  { date: '2', 		累计确诊: 17205,	'现有确诊*': 16369,	现有重症: 2296,	累计死亡: 361,	累计治愈:475,	现有疑似:21558 },
  { date: '3', 		累计确诊: 20438,	'现有确诊*': 19381,	现有重症: 2788,	累计死亡: 425,	累计治愈:632,	现有疑似:23214 },
  { date: '4', 		累计确诊: 24324,	'现有确诊*': 22942,	现有重症: 3219,	累计死亡: 490,	累计治愈:892,	现有疑似:23260 },
  { date: '5', 		累计确诊: 28018,	'现有确诊*': 26302,	现有重症: 3859,	累计死亡: 563,	累计治愈:1153,	现有疑似:24702 },
  { date: '6', 		累计确诊: 31161,	'现有确诊*': 28985,	现有重症: 4821,	累计死亡: 636,	累计治愈:1540,	现有疑似:26359 },
  { date: '7', 		累计确诊: 34546,	'现有确诊*': 31774,	现有重症: 6101,	累计死亡: 722,	累计治愈:2050,	现有疑似:27657 },
  { date: '8', 		累计确诊: 37198,	'现有确诊*': 33738,	现有重症: 6188,	累计死亡: 811,	累计治愈:2649,	现有疑似:28942 },
  { date: '9', 		累计确诊: 40171,	'现有确诊*': 35982,	现有重症: 6484,	累计死亡: 908,	累计治愈:3281,	现有疑似:23589 },
  { date: '10', 	累计确诊: 42638,	'现有确诊*': 37626,	现有重症: 7333,	累计死亡: 1016,	累计治愈:3996,	现有疑似:21675 },
  { date: '11', 	累计确诊: 44653,	'现有确诊*': 38800,	现有重症: 8204,	累计死亡: 1113,	累计治愈:4740,	现有疑似:16067 },
  { date: '12', 	累计确诊: 59804,	'现有确诊*': 39194,	'现有确诊**':52526,	现有重症: 8030,	累计死亡: 1367,	累计治愈:5911,	现有疑似:13435 },
  { date: '13', 	累计确诊: 63851,	'现有确诊**':55748,	现有重症: 10204,	累计死亡: 1380,	累计治愈:6723,	现有疑似:10109 },
  { date: '14', 	累计确诊: 66492,	'现有确诊**':56873,	现有重症: 11053,	累计死亡: 1523,	累计治愈:8096,	现有疑似:8969 },
  { date: '15', 	累计确诊: 68500,	'现有确诊**':57416,	现有重症: 11272,	累计死亡: 1665,	累计治愈:9419,	现有疑似:8228 },
  { date: '16', 	累计确诊: 70548,	'现有确诊**':57934,	现有重症: 10644,	累计死亡: 1770,	累计治愈:10844,	现有疑似:7264 },
  { date: '17', 	累计确诊: 72436,	'现有确诊**':58016,	现有重症: 11741,	累计死亡: 1868,	累计治愈:12552,	现有疑似:6242 }
];
const ds = new DataSet();
const dv = ds.createView().source(data);
// fold 方式完成了行列转换，如果不想使用 DataSet 直接手工转换数据即可
dv.transform({
  type: 'fold',
  fields: [ '现有确诊*', '现有确诊**', '现有重症', '累计死亡', '累计治愈', '现有疑似' ], // 展开字段集,去掉了'累计确诊', 
  key: 'type',   // key字段
  value: 'value' // value字段
});
// 实例化 Chart 对象
const chart = new G2.Chart({
  container: 'container',	  // 传入 dom 容器的 id
  forceFit: true,			  // 图表跟随图表容器宽度变化
  height: 500,				  // 指定图表的高度
  padding: [ 20, 20, 110, 70 ] // 上，右，下，左
});
chart.source(dv, {
  date: {
	range: [ 0, 1 ]
  }
});
chart.tooltip({
  crosshairs: {
	type: 'line'
  }
});
chart.axis('value', {
  label: {
	formatter: val => {
	  return val + '例';
	}
  }
});
chart
  .line()
  .position('date*value')
  .color('type', ['#f00', '#f00', '#b00', '#333', '#0b0', '#fd0'])	//去掉了'累计确诊'的'#f99', 
  .shape('smooth');
chart
  .point()
  .position('date*value')
  .color('type', ['#f00', '#f00', '#b00', '#333', '#0b0', '#fd0'])	//去掉了'累计确诊'的'#f99', 
  .size(4)
  .shape('circle')
  .style({
	stroke: '#fff',
	lineWidth: 1
  });
chart.render();	// 图表渲染
